input = """

1ויפל יוסף על־פני אביו ויבך עליו וישק־לו׃ 2ויצו יוסף את־עבדיו את־הרפאים לחנט את־אביו ויחנטו הרפאים את־ישראל׃ 3וימלאו־לו ארבעים יום כי כן ימלאו ימי החנטים ויבכו אתו מצרים שבעים יום׃
4ויעברו ימי בכיתו וידבר יוסף אל־בית פרעה לאמר אם־נא מצאתי חן בעיניכם דברו־נא באזני פרעה לאמר׃ 5אבי השביעני לאמר הנה אנכי מת בקברי אשר כריתי לי בארץ כנען שמה תקברני ועתה אעלה־נא ואקברה את־אבי ואשובה׃ 6ויאמר פרעה עלה וקבר את־אביך כאשר השביעך׃

7ויעל יוסף לקבר את־אביו ויעלו אתו כל־עבדי פרעה זקני ביתו וכל זקני ארץ־מצרים׃ 8וכל בית יוסף ואחיו ובית אביו רק טפם וצאנם ובקרם עזבו בארץ גשן׃ 9ויעל עמו גם־רכב גם־פרשים ויהי המחנה כבד מאד׃ 10ויבאו עד־גרן האטד אשר בעבר הירדן ויספדו־שם מספד גדול וכבד מאד ויעש לאביו אבל שבעת ימים׃ 11וירא יושב הארץ הכנעני את־האבל בגרן האטד ויאמרו אבל־כבד זה למצרים על־כן קרא שמה אבל מצרים אשר בעבר הירדן׃

12ויעשו בניו לו כן כאשר צום׃ 13וישאו אתו בניו ארצה כנען ויקברו אתו במערת שדה המכפלה אשר קנה אברהם את־השדה לאחזת־קבר מאת עפרן החתי על־פני ממרא׃ 14וישב יוסף מצרימה הוא ואחיו וכל־העלים אתו לקבר את־אביו אחרי קברו את־אביו׃

15ויראו אחי־יוסף כי־מת אביהם ויאמרו לו ישטמנו יוסף והשב ישיב לנו את כל־הרעה אשר גמלנו אתו׃ 16ויצוו אל־יוסף לאמר אביך צוה לפני מותו לאמר׃ 17כה־תאמרו ליוסף אנא שא נא פשע אחיך וחטאתם כי־רעה גמלוך ועתה שא נא לפשע עבדי אלהי אביך ויבך יוסף בדברם אליו׃ 18וילכו גם־אחיו ויפלו לפניו ויאמרו הננו לך לעבדים׃ 19ויאמר אלהם יוסף אל־תיראו כי התחת אלהים אני׃ 20ואתם חשבתם עלי רעה אלהים חשבה לטבה למען עשה כיום הזה להחית עם־רב׃ 21ועתה אל־תיראו אנכי אכלכל אתכם ואת־טפכם וינחם אותם וידבר על־לבם׃

22וישב יוסף במצרים הוא ובית אביו ויחי יוסף מאה ועשר שנים׃ 23וירא יוסף לאפרים בני שלשים גם בני מכיר בן־מנשה ילדו על־ברכי יוסף׃ 24ויאמר יוסף אל־אחיו אנכי מת ואלהים פקד יפקד אתכם והעלה אתכם מן־הארץ הזאת אל־הארץ אשר נשבע לאברהם ליצחק וליעקב׃ 25וישבע יוסף את־בני ישראל לאמר פקד יפקד אלהים אתכם והעלתם את־עצמתי מזה׃ 26וימת יוסף בן־מאה ועשר שנים ויחנטו אתו ויישם בארון במצרים׃

"""

numbers = set(["1", "2", "3", "4", "5", "6","7", "8", "9", "0"])
dic = {}
di = 0
verseend = False

for i in range(len(input)):
	if input[i] == "׃":
		verseend = True
		continue
	if input[i] == " " and i > 0 and (input[i - 1] == "׀" or input[i - 1] == " "):
		continue
	if input[i] in numbers:
		verseend = False
		if i > 0 and input[i - 1] not in numbers:
			di += 1
		continue
	if verseend or input[i] == '׀' or input[i] == """
""":
		continue
	if str(di) in dic:
		if input[i] == "־":
			dic[str(di)] += " "
			continue
		dic[str(di)] += input[i]
	else:
		dic[str(di)] = input[i]

print("{")
for val in dic:
	di -= 1
	if di != 0:
		print(f"\"{val}\" : \"{dic[val]}\",")
	else:
		print(f"\"{val}\" : \"{dic[val]}\"")
print("}")